mainster/sw4stm32_workbench/00-STM32F4_LIBRARY_MDB/md_stm32f4_gpio.c
/**
 * @file        md_stm32f4_gpio.c
 *
 * @date        28 Jan 2017
 * @author      Manuel Del Basso (mainster)
 * @email       manuel.delbasso@gmail.com
 *
 * @ide         System Workbench ac6 (eclipse stm32)
 * @stdperiph   STM32F4xx Standard peripheral drivers version 1.4.0 or greater required
 * @license		GNU GPL v3
 *
 *
   @verbatim

	------------------------------------------------------------------------

	Copyright (C) 2016  Manuel Del Basso

	This program is free software: you can redistribute it and/or modify
	it under the terms of the GNU General Public License as published by
	the Free Software Foundation, either version 3 of the License, or
	(at your option) any later version.

	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
	GNU General Public License for more details.
	You should have received a copy of the GNU General Public License
	along with this program.  If not, see <http://www.gnu.org/licenses/>.

	------------------------------------------------------------------------

   @endverbatim
 *
 */
#include "md_stm32f4_gpio.h"
#include "stm32f4xx_rcc.h"

/* Private functions */
void MD_GPIO_INT_EnableClock(GPIO_TypeDef* GPIOx);
void MD_GPIO_INT_DisableClock(GPIO_TypeDef* GPIOx);
void MD_GPIO_INT_Init(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, MD_GPIO_Mode_t GPIO_Mode, MD_GPIO_OType_t GPIO_OType, MD_GPIO_PuPd_t GPIO_PuPd, MD_GPIO_Speed_t GPIO_Speed);

void MD_GPIO_Init(	GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, MD_GPIO_Mode_t GPIO_Mode,
					MD_GPIO_OType_t GPIO_OType, MD_GPIO_PuPd_t GPIO_PuPd, MD_GPIO_Speed_t GPIO_Speed) {
	/* Check input */
	if (GPIO_Pin == 0x00) {
		return;
	}
	
	/* Enable clock for GPIO */
	MD_GPIO_INT_EnableClock(GPIOx);
	
	/* Do initialization */
	MD_GPIO_INT_Init(GPIOx, GPIO_Pin, GPIO_Mode, GPIO_OType, GPIO_PuPd, GPIO_Speed);
}

void MD_GPIO_InitAlternate(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, MD_GPIO_OType_t GPIO_OType, MD_GPIO_PuPd_t GPIO_PuPd, MD_GPIO_Speed_t GPIO_Speed, uint8_t Alternate) {
	uint32_t pinpos;

	/* Check input */
	if (GPIO_Pin == 0x00) {
		return;
	}
	
	/* Enable GPIOx clock */
	MD_GPIO_INT_EnableClock(GPIOx);
	
	/* Set alternate functions for all pins */
	for (pinpos = 0; pinpos < 0x10; pinpos++) {
		/* Check pin */
		if ((GPIO_Pin & (1 << pinpos)) == 0) {
			continue;
		}
		
		/* Set alternate function */
		GPIOx->AFR[pinpos >> 0x03] = (GPIOx->AFR[pinpos >> 0x03] & ~(0x0F << (4 * (pinpos & 0x07)))) | (Alternate << (4 * (pinpos & 0x07)));
	}
	
	/* Do initialization */
	MD_GPIO_INT_Init(GPIOx, GPIO_Pin, MD_GPIO_Mode_AF, GPIO_OType, GPIO_PuPd, GPIO_Speed);
}

void MD_GPIO_DeInit(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin) {
	uint8_t i;
	/* Go through all pins */
	for (i = 0x00; i < 0x10; i++) {
		/* Pin is set */
		if (GPIO_Pin & (1 << i)) {
			/* Set 11 bits combination for analog mode */
			GPIOx->MODER |= (0x03 << (2 * i));
		}
	}
}

void MD_GPIO_SetPinAsInput(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin) {
	uint8_t i;
	/* Go through all pins */
	for (i = 0x00; i < 0x10; i++) {
		/* Pin is set */
		if (GPIO_Pin & (1 << i)) {
			/* Set 00 bits combination for input */
			GPIOx->MODER &= ~(0x03 << (2 * i));
		}
	}
}

void MD_GPIO_SetPinAsOutput(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin) {
	uint8_t i;
	/* Go through all pins */
	for (i = 0x00; i < 0x10; i++) {
		/* Pin is set */
		if (GPIO_Pin & (1 << i)) {
			/* Set 01 bits combination for output */
			GPIOx->MODER = (GPIOx->MODER & ~(0x03 << (2 * i))) | (0x01 << (2 * i));
		}
	}
}

void MD_GPIO_SetPinAsAnalog(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin) {
	uint8_t i;
	/* Go through all pins */
	for (i = 0x00; i < 0x10; i++) {
		/* Pin is set */
		if (GPIO_Pin & (1 << i)) {
			/* Set 11 bits combination for analog mode */
			GPIOx->MODER |= (0x03 << (2 * i));
		}
	}
}

uint16_t MD_GPIO_GetPortSource(GPIO_TypeDef* GPIOx) {
	uint8_t portsource = 0;
#ifdef GPIOA
	if (GPIOx == GPIOA) {
		portsource = 0x00;
	}
#endif
#ifdef GPIOB
	if (GPIOx == GPIOB) {
		portsource = 0x01;
	}
#endif
#ifdef GPIOC
	if (GPIOx == GPIOC) {
		portsource = 0x02;
	}
#endif
#ifdef GPIOD
	if (GPIOx == GPIOD) {
		portsource = 0x03;
	}
#endif
#ifdef GPIOE
	if (GPIOx == GPIOE) {
		portsource = 0x04;
	}
#endif
#ifdef GPIOF
	if (GPIOx == GPIOF) {
		portsource = 0x05;
	}
#endif
#ifdef GPIOG
	if (GPIOx == GPIOG) {
		portsource = 0x06;
	}
#endif
#ifdef GPIOH
	if (GPIOx == GPIOH) {
		portsource = 0x07;
	}
#endif
#ifdef GPIOI
	if (GPIOx == GPIOI) {
		portsource = 0x08;
	}
#endif
#ifdef GPIOJ
	if (GPIOx == GPIOJ) {
		portsource = 0x09;
	}
#endif
#ifdef GPIOK
	if (GPIOx == GPIOK) {
		portsource = 0x0A;
	}
#endif
	
	/* Return port source */
	return portsource;
}

uint16_t MD_GPIO_GetPinSource(uint16_t GPIO_Pin) {
	uint16_t pinsource = 0;
	
	/* Get pin source */
	while (GPIO_Pin > 1) {
		/* Increment pin source */
		pinsource++;
		/* Shift right */
		GPIO_Pin >>= 1;
	}
	
	/* Return source */
	return pinsource;
}

/* Private functions */
void MD_GPIO_INT_EnableClock(GPIO_TypeDef* GPIOx) {
#ifdef GPIOA
	if (GPIOx == GPIOA) {
		RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;
	}
#endif
#ifdef GPIOB
	if (GPIOx == GPIOB) {
		RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN;
	}
#endif
#ifdef GPIOC
	if (GPIOx == GPIOC) {
		RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN;
	}
#endif
#ifdef GPIOD
	if (GPIOx == GPIOD) {
		RCC->AHB1ENR |= RCC_AHB1ENR_GPIODEN;
	}
#endif
#ifdef GPIOE
	if (GPIOx == GPIOE) {
		RCC->AHB1ENR |= RCC_AHB1ENR_GPIOEEN;
	}
#endif
#ifdef GPIOF
	if (GPIOx == GPIOF) {
		RCC->AHB1ENR |= RCC_AHB1ENR_GPIOFEN;
	}
#endif
#ifdef GPIOG
	if (GPIOx == GPIOG) {
		RCC->AHB1ENR |= RCC_AHB1ENR_GPIOGEN;
	}
#endif
#ifdef GPIOH
	if (GPIOx == GPIOH) {
		RCC->AHB1ENR |= RCC_AHB1ENR_GPIOHEN;
	}
#endif
#ifdef GPIOI
	if (GPIOx == GPIOI) {
		RCC->AHB1ENR |= RCC_AHB1ENR_GPIOIEN;
	}
#endif
#ifdef GPIOJ
	if (GPIOx == GPIOJ) {
		RCC->AHB1ENR |= RCC_AHB1ENR_GPIOJEN;
	}
#endif
#ifdef GPIOK
	if (GPIOx == GPIOK) {
		RCC->AHB1ENR |= RCC_AHB1ENR_GPIOKEN;
	}
#endif
}

void MD_GPIO_INT_DisableClock(GPIO_TypeDef* GPIOx) {
#ifdef GPIOA
	if (GPIOx == GPIOA) {
		RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOAEN;
	}
#endif
#ifdef GPIOB
	if (GPIOx == GPIOB) {
		RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOBEN;
	}
#endif
#ifdef GPIOC
	if (GPIOx == GPIOC) {
		RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOCEN;
	}
#endif
#ifdef GPIOD
	if (GPIOx == GPIOD) {
		RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIODEN;
	}
#endif
#ifdef GPIOE
	if (GPIOx == GPIOE) {
		RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOEEN;
	}
#endif
#ifdef GPIOF
	if (GPIOx == GPIOF) {
		RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOFEN;
	}
#endif
#ifdef GPIOG
	if (GPIOx == GPIOG) {
		RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOGEN;
	}
#endif
#ifdef GPIOH
	if (GPIOx == GPIOH) {
		RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOHEN;
	}
#endif
#ifdef GPIOI
	if (GPIOx == GPIOI) {
		RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOIEN;
	}
#endif
#ifdef GPIOJ
	if (GPIOx == GPIOJ) {
		RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOJEN;
	}
#endif
#ifdef GPIOK
	if (GPIOx == GPIOK) {
		RCC->AHB1ENR &= ~RCC_AHB1ENR_GPIOKEN;
	}
#endif
}

void MD_GPIO_INT_Init(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, MD_GPIO_Mode_t GPIO_Mode, MD_GPIO_OType_t GPIO_OType, MD_GPIO_PuPd_t GPIO_PuPd, MD_GPIO_Speed_t GPIO_Speed) {
	uint8_t pinpos;
	
	/* Go through all pins */
	for (pinpos = 0; pinpos < 0x10; pinpos++) {
		/* Check if pin available */
		if ((GPIO_Pin & (1 << pinpos)) == 0) {
			continue;
		}
		
		/* Set GPIO MODE register */
		GPIOx->MODER = (GPIOx->MODER & ~((uint32_t)(0x03 << (2 * pinpos)))) | ((uint32_t)(GPIO_Mode << (2 * pinpos)));
		
		/* Set only if output or alternate functions */
		if ((GPIO_Mode == MD_GPIO_Mode_OUT) || GPIO_Mode == MD_GPIO_Mode_AF) {
			/* Set GPIO OTYPE register */
			GPIOx->OTYPER = (GPIOx->OTYPER & ~(uint16_t)(0x01 << pinpos)) | ((uint16_t)(GPIO_OType << pinpos));
			
			/* Set GPIO OSPEED register */
			GPIOx->OSPEEDR = (GPIOx->OSPEEDR & ~((uint32_t)(0x03 << (2 * pinpos)))) | ((uint32_t)(GPIO_Speed << (2 * pinpos)));
		}
		
		/* Set GPIO PUPD register */
		GPIOx->PUPDR = (GPIOx->PUPDR & ~(0x03 << (2 * pinpos))) | ((uint32_t)(GPIO_PuPd << (2 * pinpos)));
	}
}
